import time

from pws.app import 应用模块
from pws.app.core.公共类型定义.数据库文档模型 import 文档内容模型, 文档模型


def main():
    实例=应用模块(数据库连接字符串="mongodb://localhost:27019/",数据库名称="pws_test")
    app=实例.事件总线实例.总线内嵌http框架
    @app.路由("/")
    def 首页(请求):
        print("🟠【框架层】执行业务逻辑：首页")
        print(请求.__dict__)
        #导入堆栈
        import traceback
        #输出堆栈
        return app.响应对象(内容="你好，这里是最小框架！")

    @app.路由("/hello")
    def 打招呼(请求):
        print("🟠【框架层】执行业务逻辑：打招呼")

        return app.响应对象(内容="Hello World —— 来自简易框架")
    @app.websocket路由("/ws")
    def 处理_websocket_消息(数据):
        print("🟠【框架层】处理 WebSocket 消息")
        客户端=数据.websocket
        消息=数据.消息
        opcode=数据.opcode
        print(f"客户端: {客户端}")
        print(f"消息: {消息}")
        print(f"opcode: {opcode}")


        客户端.发送消息(消息)  # 回显消息

    实例.事件总线实例.总线内嵌http服务器(总线=实例.事件总线实例).启动()

if __name__ == "__main__":
    main()



#
# if __name__ == "__main__":
#
#
#
#     实例=应用模块(数据库连接字符串="mongodb://localhost:27019/",数据库名称="pws_test")
#     测试数据集="测试数据集bbb"
#     实例.事件总线实例.发布("数据操作.创建数据集",事件数据={"数据集名称":测试数据集})
#     内容=文档内容模型(名称="测试文档1",应用="测试应用1",账号="测试账号1",密码="测试密码1",
#                 邮箱="测试邮箱1",邮箱密码="测试邮箱密码1",网站="测试网站1",备注="测试备注1")
#
#
#     #测试插入文档
#
#     实例.事件总线实例.发布("数据操作.插入文档",事件数据={"数据集名称":测试数据集,"文档内容":内容})
#
#     #测试查询文档
#     查询结果=实例.事件总线实例.发布("数据操作.查询文档",事件数据={"数据集名称":测试数据集,"查询条件":{"文档内容.名称": "测试文档1"}})
#
#     print(查询结果.转字典())
#     uuid=查询结果.事件返回.get("数据操作适配器").数据.get("文档列表")[0].uuid
#     print(查询结果.转字典())
#
#
#     #测试更新文档
#     更新内容=文档内容模型(密码="操操操操操操操")
#     更新文档=文档模型(uuid=uuid,文档内容=更新内容)
#     print(更新内容.转字典())
#     实例.事件总线实例.发布("数据操作.更新文档",事件数据={"数据集名称":测试数据集,"文档uuid":uuid,"更新内容":更新文档})
#
#
#     查询结果=实例.事件总线实例.发布("数据操作.查询文档",事件数据={"数据集名称":测试数据集,"查询条件":{"文档内容.名称": "测试文档1"}})
#     print(查询结果.转字典())
#     查询结果=实例.事件总线实例.发布("数据操作.查询文档",事件数据={"数据集名称":测试数据集,"查询条件":{"uuid":uuid}})
#     print(查询结果.转字典())
#
#     实例.事件总线实例.发布("数据操作.删除文档",事件数据={"数据集名称":测试数据集,"文档uuid":uuid})
#
#     查询结果=实例.事件总线实例.发布("数据操作.查询文档",事件数据={"数据集名称":f"{测试数据集}_历史记录","查询条件":{"文档uuid":uuid}})
#     print(查询结果.转字典())
#





